# models/yolov5sFire.yaml
nc: 1  # 类别数
depth_multiple: 0.33
width_multiple: 0.50
anchors:
  - [10,13, 16,30, 33,23]
  - [30,61, 62,45, 59,119]
  - [116,90, 156,198, 373,326]

backbone:
  [[-1, 1, GhostConv, [64, 3, 2]],  # 0-P1/2 (64 * 0.5=32)
   [-1, 1, CBAM, [32]],             # 输入通道32
   [-1, 1, GhostConv, [128, 3, 2]], # 1-P2/4 (128 * 0.5=64)
   [-1, 3, C3Ghost, [128]],  # 增加C3Ghost模块增强特征复用
   [-1, 1, CBAM, [64]],
   [-1, 1, SPPFire, [64, 64]],
   [-1, 1, GhostConv, [256, 3, 2]], # 3-P3/8 (256 * 0.5=128)
   [-1, 1, GhostConv, [128, 3, 1]], # 输出64 (128 * 0.5)
   [-1, 1, CBAM, [64]],             # 输入通道64
  ]

head:
  [[-1, 1, GhostConv, [512, 3, 2]],  # 6-P4/16 (512 * 0.5=256)
   [-1, 1, SPPFire, [256, 256]],
   [-1, 1, GhostConv, [1024, 3, 2]], # 8-P5/32 (1024 * 0.5=512)
   [-1, 1, CBAM, [512]],
   [[5,7,9], 1, Detect, [nc, anchors]]  # 仅传递nc和anchors
  ]
